/**
* @file lab5_2.cpp
* @author Пацалюк А.В., гр. 515-і2
* @date 26 травня 2024
* @brief Лабораторна робота № 5
*
* Застосування вказівників. Завдання 2
*/
#include <stdio.h>
#include <locale.h>
#define N 10 // Визначення розміру масиву

/**
* Заповнення масиву
*
* @param arr - масив, який треба заповнити
*/
void mas_scanf(int* arr);

/**
* Пошук чисел менше ста, що дорівнюють ста, і більше ста
*
* @param arr - масив, у якому потрібно шукати
* @param less100 - лічильник чисел, що менше за сто
* @param eq100 - лічильник чисел, що дорівнюють ста
* @param greater100 - лічильник чисел, що більше за сто
*/
void mas_search(int* arr, int* less100, int* eq100, int* greater100);

int main() {
    int arr[N], less100_main = 0, eq100_main = 0, greater100_main = 0;

    // Встановлення локалі для підтримки української мови
    setlocale(LC_ALL, "Ukr");

    // Запит на введення чисел масиву
    printf("Введіть %d чисел масиву: ", N);

    // Виклик функції для заповнення масиву
    mas_scanf(arr);

    // Виклик функції для пошуку чисел відповідних категорій
    mas_search(arr, &less100_main, &eq100_main, &greater100_main);

    // Виведення результатів
    printf("Кількість чисел менше ста: %d\n", less100_main);
    printf("Кількість чисел, що дорівнюють ста: %d\n", eq100_main);
    printf("Кількість чисел більше ста: %d\n", greater100_main);
}

void mas_scanf(int* arr) {
    // Проходження масиву за допомогою вказівників
    for (int* p = arr; p < arr + N; ++p)
        scanf_s("%d", p); // Зчитування значення у поточний елемент масиву
}

void mas_search(int* arr, int* less100, int* eq100, int* greater100) {
    // Проходження масиву за допомогою вказівників
    for (int* p = arr; p < arr + N; ++p) {
        if (*p < 100)
            (*less100)++; // Збільшення лічильника чисел, що менше ста
        else if (*p == 100)
            (*eq100)++; // Збільшення лічильника чисел, що дорівнюють ста
        else
            (*greater100)++; // Збільшення лічильника чисел, що більше ста
    }
}
